app/Controllers/BaseController.php

INSERT INTO `z_logs` (`user_id`, `activity`, `log_time`) VALUES ('4', 'login', '2023-08-03 05:03:44 PM|::1|08-8F-C3-47-18-49   Disconnected')
---
    public function z_logs($user_id, $activity){

        $z_logs = new LogsModel();
        $datetime = date('Y-m-d h:i:s A');
        $ip = $_SERVER['REMOTE_ADDR'];
        $mac = exec('getmac');

        $log_time = $datetime . "|" . $ip ."|" . $mac;

        $data = array(
            'user_id' => $user_id,
            'activity' => $activity,
            'log_time' => $log_time
        );

        $z_logs->save($data);