app/Controllers/Users.php

SELECT COUNT(*) AS `numrows`
FROM `participants`
SELECT COUNT(*) AS `numrows`
FROM `participants`
WHERE `firstname` LIKE '%%' ESCAPE '!'
OR  `lastname` LIKE '%%' ESCAPE '!'
SELECT *
FROM `participants`
WHERE `id` LIKE '%%' ESCAPE '!'
OR  `firstname` LIKE '%%' ESCAPE '!'
OR  `lastname` LIKE '%%' ESCAPE '!'
ORDER BY `id` ASC
 LIMIT 10
---
    public function getParticipant(){

       $request = service('request');
       $postData = $request->getPost();
       $dtpostData = $postData['data'];
       $response = array();

       ## Read value
       $draw = $dtpostData['draw'];
       $start = $dtpostData['start'];
       $rowperpage = $dtpostData['length']; // Rows display per page
       $columnIndex = $dtpostData['order'][0]['column']; // Column index
       $columnName = $dtpostData['columns'][$columnIndex]['data']; // Column name
       $columnSortOrder = $dtpostData['order'][0]['dir']; // asc or desc
       $searchValue = $dtpostData['search']['value']; // Search value

       ## Total number of records without filtering
       $employee = new ParticipantsModel();
       $totalRecords = $employee->select('id')
                     ->countAllResults();

       ## Total number of records with filtering
       $totalRecordwithFilter = $employee->select('id')
            ->orLike('firstname', $searchValue)
            ->orLike('lastname', $searchValue)
            ->countAllResults();

       ## Fetch records
       $records = $employee->select('*')
            ->orLike('id', $searchValue)
            ->orLike('firstname', $searchValue)
            ->orLike('lastname', $searchValue)
            ->orderBy($columnName,$columnSortOrder)
            ->findAll($rowperpage, $start);