app/Models/LessonsModel.php

SELECT *
FROM `lessons`
---
    public function getLessons() {
      $sql = $this->select('*');
      $query = $sql->get();