app/Models/ParticipantsModel.php

    public function getParticipantData($id){
        return $this->where('id', $id)->first();
---
SELECT *
FROM `participants`
WHERE `id` = '5'
 LIMIT 1